1.创建一个包含姓名和年龄的DataFrame，数据如下

In [3]:
import pandas as pd
data = {
    '姓名': ['Tom', 'Jerry', 'Amy', 'Tom', 'Emily'],
    '年龄': [20, 25, 30, 20, 27]
}
df = pd.DataFrame(data)
df

      姓名  年龄
0    Tom  20
1  Jerry  25
2    Amy  30
3    Tom  20
4  Emily  27

2.显示创建的DataFrame前两行数据

In [4]:
df.head(2)

      姓名  年龄
0    Tom  20
1  Jerry  25

3.显示创建的DataFrame后三行数据

In [5]:
df.tail(3)

      姓名  年龄
2    Amy  30
3    Tom  20
4  Emily  27

4.提取出名字相同的'Tom'行，输出所有列表头名

In [7]:
tom = df[df['姓名'] == 'Tom']
tom

    姓名  年龄
0  Tom  20
3  Tom  20

In [8]:
df.columns

Index(['姓名', '年龄'], dtype='object')

5.修改第二列的表头'年龄'为'age'

In [11]:
df.rename(columns= {'年龄': 'age'})

      姓名  age
0    Tom   20
1  Jerry   25
2    Amy   30
3    Tom   20
4  Emily   27

6.按照姓名列进行去重

In [12]:
df.drop_duplicates(['姓名'])

      姓名  age
0    Tom   20
1  Jerry   25
2    Amy   30
4  Emily   27

In [ ]:
7.统计年龄的平均值

In [13]:
df['age'].mean()

24.4

8.查找年龄大于23的行

In [14]:
age_over_23 = df[df['age']> 23]
age_over_23

      姓名  age
1  Jerry   25
2    Amy   30
4  Emily   27

9.按照年龄降序排列

In [15]:
age_sorted = df.sort_values(by='age', ascending=False)
age_sorted

      姓名  age
2    Amy   30
4  Emily   27
1  Jerry   25
0    Tom   20
3    Tom   20

10.计算年龄的总和

In [16]:
age_sum = df['age'].sum()
age_sum

122

11. 更改Jerry的年龄为35，并且显示更新后的数据

In [18]:
df.loc[df['姓名'] == 'Jerry', 'age'] = 35
df

      姓名  age
0    Tom   20
1  Jerry   35
2    Amy   30
3    Tom   20
4  Emily   27

12.删除年龄大于30的行，并且显示更新后的数据

In [20]:
 df[df['age'] <= 30]

      姓名  age
0    Tom   20
2    Amy   30
3    Tom   20
4  Emily   27

13.将姓名列转换为list

In [21]:
df['姓名'].tolist()

['Tom', 'Jerry', 'Amy', 'Tom', 'Emily']

14.将姓名转换为全大写，并添加一个新的姓名（大写）列

In [22]:
df['姓名（大写）'] = df['姓名'].str.upper()
df

      姓名  age 姓名（大写）
0    Tom   20    TOM
1  Jerry   35  JERRY
2    Amy   30    AMY
3    Tom   20    TOM
4  Emily   27  EMILY

15.将DataFrame保存为CSV文件

In [24]:
df.to_csv('data.csv', index=False)

16.查看最后两行数据

In [25]:
df.tail(2)

      姓名  age 姓名（大写）
3    Tom   20    TOM
4  Emily   27  EMILY

17.删除最后一行数据

In [27]:
# df[:-1]
df.drop(df.index[-1])

      姓名  age 姓名（大写）
0    Tom   20    TOM
1  Jerry   35  JERRY
2    Amy   30    AMY
3    Tom   20    TOM

18.添加一行数据姓名Rose 年龄20

In [28]:
new_row = {'姓名':'Rose', 'age': 20}
df.loc[df.index[-1]+1] = new_row
df

      姓名  age 姓名（大写）
0    Tom   20    TOM
1  Jerry   35  JERRY
2    Amy   30    AMY
3    Tom   20    TOM
4  Emily   27  EMILY
5   Rose   20    NaN

19. 对数据按照'年龄'列值的大小进行排序

In [29]:
df.sort_values(by='age', ascending=False)

      姓名  age 姓名（大写）
1  Jerry   35  JERRY
2    Amy   30    AMY
4  Emily   27  EMILY
0    Tom   20    TOM
3    Tom   20    TOM
5   Rose   20    NaN

20.统计'姓名'列每个字符串的长度

In [30]:
df['姓名'] = df['姓名'].fillna('空值')
df['str_len'] = df['姓名'].map(lambda x:len(x))
df

      姓名  age 姓名（大写）  str_len
0    Tom   20    TOM        3
1  Jerry   35  JERRY        5
2    Amy   30    AMY        3
3    Tom   20    TOM        3
4  Emily   27  EMILY        5
5   Rose   20    NaN        4

21.将年龄分为不同的年龄段（20以下、20-30、30以上），并统计每个年龄段的人数

In [35]:
bins = [0, 20, 30, float('inf')]
labels = ['20以下', '20-30', '30以上']
df['年龄段'] = pd.cut(df['age'], bins=bins, labels=labels)
age_count = df['年龄段'].value_counts().reset_index()
age_count.columns = ['年龄段', '人数']
age_count

     年龄段  人数
0   20以下   3
1  20-30   2
2   30以上   1

22.删除年龄段列

In [37]:
removed_age_count_df = df.drop('年龄段', axis=1)
removed_age_count_df

      姓名  age 姓名（大写）  str_len
0    Tom   20    TOM        3
1  Jerry   35  JERRY        5
2    Amy   30    AMY        3
3    Tom   20    TOM        3
4  Emily   27  EMILY        5
5   Rose   20    NaN        4

23.删除含有缺失值的行

In [38]:
df.dropna()

      姓名  age 姓名（大写）  str_len    年龄段
0    Tom   20    TOM        3   20以下
1  Jerry   35  JERRY        5   30以上
2    Amy   30    AMY        3  20-30
3    Tom   20    TOM        3   20以下
4  Emily   27  EMILY        5  20-30

24.计算'age','str_len'列的均值

In [42]:
age_mean = df['age'].mean()
str_len_mean = df['str_len'].mean()
print(age_mean, str_len_mean)

25.333333333333332 3.8333333333333335

25.查找含有指定关键字的行，'姓名'中的'Tom'

In [46]:
name = 'Tom'
res = df[df['姓名'].str.contains(name)]
res

    姓名  age 姓名（大写）  str_len   年龄段
0  Tom   20    TOM        3  20以下
3  Tom   20    TOM        3  20以下